Revit 2025 API
DuctFittingAndAccessoryData Class
 The input data used by external servers for calculation of the duct fitting and duct accessory coefficient.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class DuctFittingAndAccessoryData : IDisposable
Public Class DuctFittingAndAccessoryData
	Implements IDisposable
public ref class DuctFittingAndAccessoryData : IDisposable
type DuctFittingAndAccessoryData =
    class
        interface IDisposable
    end
The DuctFittingAndAccessoryData type exposes the following members.
Properties
Name | Description
AirViscosity |  The kinematic viscosity of air for the duct fitting or duct accessory, Units: (ft^2/s).
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Origin |  The origin position of the duct fitting or duct accessory.
PartType |  The part type of the duct fitting or duct accessory.
ServerGUID |  The GUID of the duct fitting or duct accessory.
SystemClassification |  The system classification of the duct fitting or duct accessory.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DuctFittingAndAccessoryData
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAllConnectorData |  Gets the connector data of the pipe fitting or pipe accessory.
GetEntity |  Returns an Entity of the Schema of the serverGUID. or an invalid entity otherwise.
GetFamilyInstanceId |  Gets the Id of the fiting or accessory instance
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 A FamilyInstance is the input data for the calculation,
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace